rails-back/app/controllers/api/v1/features_controller.rb

  def index
    @features = Feature.all
---
SELECT "features".* FROM "features" ORDER BY id ASC

  def show
    @feature = Feature.find(params[:id])
---
SELECT  "features".* FROM "features" WHERE "features"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @feature = Feature.create(name: params[:data][:attributes][:name])
---
INSERT INTO "features" ("name") VALUES ($1) RETURNING "id"  [["name", "Feature 2"]]