rails-back/app/controllers/api/v1/features_controller.rb

DELETE FROM "features" WHERE "features"."id" = $1  [["id", 11]]
---
  def destroy
    @feature = Feature.destroy(params[:id])