rails-back/app/controllers/api/v1/tests_controller.rb

SELECT "tests".* FROM "tests" WHERE "tests"."feature_id" = $1  [["feature_id", 13]]
SELECT  "features".* FROM "features" WHERE "features"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
SELECT "tests".* FROM "tests" WHERE "tests"."featureid" = $1 ORDER BY id ASC  [["featureid", 25]]
---
  def index
    if (params.has_key?(:filter) && params[:filter].has_key?(:feature))
      @tests = Test.where(featureid: params[:filter][:feature]).order("id ASC")
    else
      @tests = Test.all.order("id ASC")

INSERT INTO "tests" ("name", "state", "featureid") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Test 1"], ["state", "passed"], ["featureid", 24]]
---
  def create
    @test = Test.create(name: params[:data][:attributes][:name], state: params[:data][:attributes][:state], featureid: params[:data][:attributes][:feature])

SELECT  "tests".* FROM "tests" WHERE "tests"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
---
  def show
    @test = Test.find(params[:id])

SELECT  "tests".* FROM "tests" WHERE "tests"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
UPDATE "tests" SET "state" = $1 WHERE "tests"."id" = $2  [["state", "passed"], ["id", 21]]
---
  def update
    @test = Test.find(params[:id])
    @test.update(state: params[:data][:attributes][:state])

DELETE FROM "tests" WHERE "tests"."id" = $1  [["id", 21]]
---
  def destroy
    @test = Test.destroy(params[:id])